Tekla Open API Reference for Tekla Structures 2025
GADrawing Constructor (String, Size)
 Instantiates a new GA drawing with attributes. Loads the specified attribute file and overrides with the given layout attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public GADrawing(
	string AttributeFile,
	Size SheetSize
)
Public Sub New (
	AttributeFile As String,
	SheetSize As Size
)
Parameters
AttributeFile
Type: System.String
The name of the attribute file to use.
SheetSize
Type: Tekla.Structures.Drawing.Size
The sheet size of the new GA drawing.
See Also
Reference
GADrawing Class
GADrawing Overload
Tekla.Structures.Drawing Namespace